In [3]:
#import dependencies
import pandas as pd

In [4]:
#read in data file and make into a dataframe
purchase_df = pd.read_csv("../Resources/purchase_data.csv")
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
#display total number of players
players = purchase_df["SN"].unique()
total_players = len(players)
print(f"The total number of players is {total_players}")

The total number of players is 576

In [6]:
# Number of unique items
items = purchase_df["Item Name"].unique()
total_items = len(items)
#average price per item
avg_calc = purchase_df["Price"].mean()
avg_price = "${:,.2f}".format(avg_calc)
#Number of purchases
num_purchase = purchase_df["Price"].count()#Total revenue
rev_calc = purchase_df["Price"].sum()
tot_rev = "${:,.2f}".format(rev_calc)

In [7]:
#Summary Dataframe
table = [{"Number of Unique Items":total_items, "Average Price": avg_price, "Number of Purchases":num_purchase, "Total Revenue":tot_rev}]
sum_df = pd.DataFrame(table)
sum_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [56]:
#Percentage and count of players
gender = purchase_df["Gender"].value_counts()
gender_df = pd.DataFrame(gender)
gender_df_new = gender_df.rename(columns={"Gender":"Total Count"})
gender_df_new["Percentage of Players"] = (gender_df_new["Total Count"]/gender_df_new["Total Count"].sum())*100
gender_df_new["Percentage of Players"] = gender_df_new["Percentage of Players"].map('{:,.2f}%'.format)
gender_df_new

                       Total Count Percentage of Players
Male                           652                83.59%
Female                         113                14.49%
Other / Non-Disclosed           15                 1.92%

In [78]:
# Purchasing Analysis (Gender)
gender_group1= purchase_df.groupby("Gender")["Purchase ID"].count()
gender_group2= purchase_df.groupby("Gender")["Price"].mean()
gender_group2 = gender_group2.rename("Average Purchase Price") 
gender_group3= purchase_df.groupby("Gender")["Price"].sum()
gender_group3 = gender_group3.rename("Total Purchase Value") 
avg_purchase_price = purchase_df.groupby(["Gender","SN"]).sum()
avg_tot_purchase = avg_purchase_price.groupby("Gender")["Price"].mean()
avg_tot_purchase= avg_tot_purchase.rename("Avg Total Purchase per Person") 
gender_tot_df =pd.concat([gender_group1, gender_group2,gender_group3,avg_tot_purchase], axis = 1)
gender_tot_df['Average Purchase Price'] = gender_tot_df['Average Purchase Price'].map('${:,.2f}'.format)
gender_tot_df['Total Purchase Value'] = gender_tot_df['Total Purchase Value'].map('${:,.2f}'.format)
gender_tot_df['Avg Total Purchase per Person'] = gender_tot_df['Avg Total Purchase per Person'].map('${:,.2f}'.format)
gender_tot_df

,Purchase ID,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [108]:
#Age Demographics
bins = [0, 9, 14, 19, 24,29,34,39,100]
group_names = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]
purchase_df["Age Group"] = pd.cut(purchase_df["Age"], bins, labels = group_names, include_lowest = True)
age_df = purchase_df.groupby("Age Group").count()
age_df["Percentage of Players"] = (age_df["Age"]/age_df["SN"].sum())*100
age_df_final = age_df[["Purchase ID","Percentage of Players"]]
age_df_final = age_df_final.rename(columns = {"Purchase ID": "Total Count"})
age_df_final["Percentage of Players"] = age_df_final["Percentage of Players"].map('{:,.2f}%'.format)
age_df_final

           Total Count Percentage of Players
Age Group
<10                 23                 2.95%
10-14               28                 3.59%
15-19              136                17.44%
20-24              365                46.79%
25-29              101                12.95%
30-34               73                 9.36%
35-39               41                 5.26%
40+                 13                 1.67%

In [121]:
#Purchasing Analysis (Age)
purchase_df
age_purchase_count = purchase_df.groupby("Age Group")["Price"].count()
age_purchase_count = age_purchase_count.rename("Purchase Count")
age_avg_purchase = purchase_df.groupby("Age Group")["Price"].mean()
age_avg_purchase = age_avg_purchase.rename("Average Purchase Price")
age_tot_purchase = purchase_df.groupby("Age Group")["Price"].sum()
age_tot_purchase = age_tot_purchase.rename("Total Purchase Value")
avg_purchase_price_age = purchase_df.groupby(["Age Group","SN"]).sum()
age_avg_tot_person = avg_purchase_price_age.groupby("Age Group")["Price"].mean()
age_avg_tot_person = age_avg_tot_person.rename("Avg Total Purchase per Person")
age_tot_df =pd.concat([age_purchase_count, age_avg_purchase,age_tot_purchase,age_avg_tot_person], axis = 1)
age_tot_df['Average Purchase Price'] = age_tot_df['Average Purchase Price'].map('${:,.2f}'.format)
age_tot_df['Total Purchase Value'] = age_tot_df['Total Purchase Value'].map('${:,.2f}'.format)
age_tot_df['Avg Total Purchase per Person'] = age_tot_df['Avg Total Purchase per Person'].map('${:,.2f}'.format)
age_tot_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Group,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

In [146]:
# Top Spenders
x = purchase_df.groupby("SN")["Price"].sum()
#y =purchase_df.groupby("SN")["Purchase ID"].count()
y = x.sort_values(ascending=False)
#drop SNs that are not top 5
#source: https://stackoverflow.com/questions/34641056/removing-elements-from-pandas-series-in-python
y.drop(y.index[5:])

test = purchase_df.groupby("SN").sum()
test.sort_values("Price", ascending = False)

             Purchase ID  Age  Item ID  Price
SN
Lisosia93           1630  125      442  18.96
Idastidru52         1999   96      527  15.45
Chamjask73          1306   66      339  13.83
Iral74              2285   84      518  13.62
Iskadarya95          713   60      321  13.10
...                  ...  ...      ...    ...
Ililsasya43          702   19       12   1.02
Irilis75             582   20       19   1.02
Aidai61              282   21      155   1.01
Chanirra79           586   23      155   1.01
Alo38                 63   20      125   1.00

[576 rows x 4 columns]